---
kind: method
id: M:Autodesk.Revit.DB.ViewSchedule.RefreshData
zh: 明细表
source: html/db4ed392-dd6c-0354-575a-e3f9e315efcd.htm
---
# Autodesk.Revit.DB.ViewSchedule.RefreshData Method

**中文**: 明细表

Rebuilds the schedule data if it is out of date.

## Syntax (C#)
```csharp
public bool RefreshData()
```

## Returns
True if the data is up to date after the refresh.